<b><h2>Importing Packages</b></h2>

In [3]:
import pandas as pd
import numpy as np

<b><h2>Creating a Dataframe </h2><b>
<ol>
<li>Create a dictionary
<li>Convert it into a df
</ol>

In [19]:
data_dict = {
    'Names':['Aditya', 'Vamsi', 'Nithin', 'Varshith', 'Sidharth', 'Lohit', 'Sai'],
    'YoB': [2003, 2003, 2004, 2003, 2004, 2004, 2003],
    'fav_actor': [None,'Bob','bhAAi','PK',None,'bhAAi','PraBOSS'],
    'College': ['Bhavans', 'IITH', 'Sreenidhi', None,'Bhavans','IITKGP','Anurag'],
    'Has_Glasses': [True,False,False,False,True,False,False]
}

data_df = pd.DataFrame(data_dict)

In [5]:
data_df

      Names   YoB fav_actor    College  Has_Glasses
0    Aditya  2003      None    Bhavans         True
1     Vamsi  2003       Bob       IITH        False
2    Nithin  2004     bhAAi  Sreenidhi        False
3  Varshith  2003        PK       None        False
4  Sidharth  2004      None    Bhavans         True
5     Lohit  2004     bhAAi     IITKGP        False
6       Sai  2003   PraBOSS     Anurag        False

<h3><b>Selecting Row(s) </b></h3>

In [6]:
data_df.loc[1]

Names          Vamsi
YoB             2003
fav_actor        Bob
College         IITH
Has_Glasses    False
Name: 1, dtype: object

In [7]:
data_df.loc[1:3]

      Names   YoB fav_actor    College  Has_Glasses
1     Vamsi  2003       Bob       IITH        False
2    Nithin  2004     bhAAi  Sreenidhi        False
3  Varshith  2003        PK       None        False

<h3><b>Setting the Value of a row</h3></b>

In [18]:
data_df.loc[0] = "Replaced"
data_df

      Names       YoB fav_actor      College Has_Glasses
0  Replaced  Replaced  Replaced     Replaced    Replaced
1     Vamsi      2003       Bob         IITH       False
2    Nithin      2004     bhAAi    Sreenidhi       False
3  Varshith      2003        PK  Geethanjali       False
4  Sidharth      2004      None      Bhavans        True
5     Lohit      2004     bhAAi       IITKGP       False
6       Sai      2003   PraBOSS       Anurag       False

<b color="red">NOTE:</b> <br> Run the second cell again to restore the dataframe

<h3><b>Selecting Rows based on a Condition</h3></b>

In [8]:
data_df.loc[data_df['fav_actor'] == 'bhAAi']

    Names   YoB fav_actor    College  Has_Glasses
2  Nithin  2004     bhAAi  Sreenidhi        False
5   Lohit  2004     bhAAi     IITKGP        False

<h3><b> Selecting Rows and specific Columns </h3></b>

In [9]:
data_df.loc[data_df['fav_actor']=='bhAAi','Names']

2    Nithin
5     Lohit
Name: Names, dtype: object

<h3><b>Updating and Setting the values of particular rows </b></h3>

In [15]:
data_df.loc[data_df['College'].isnull(),'College'] = 'Geethanjali'

In [16]:
data_df.loc[data_df['College'] == 'Geethanjali']

      Names   YoB fav_actor      College  Has_Glasses
3  Varshith  2003        PK  Geethanjali        False

<h3><b>Selecting rows based on Multiple Conditions  </h3></b>

In [22]:
data_df.loc[((data_df['Has_Glasses']) & (data_df['YoB'] == 2003)),'Names']

0    Aditya
Name: Names, dtype: object